src/cf/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18/118</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10/110</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20/120</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыСтавокНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыСтавокНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пониженная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нулевая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтавкиНДС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет ставки НДС, операции, отраженные по которым, подлежат регистрации в книге продаж.
//
// Параметры:
//   Параметры - Структура - параметры для определения ставок
//     * ВерсияПостановленияНДС1137 - Число - см. УчетНДСПереопределяемый.ВерсияПостановленияНДС1137.
//
// Возвращаемое значение:
//   Массив - ставки НДС
Функция СтавкиПоОперациямОтражаемымВКнигеПродаж(ВерсияПостановленияНДС1137) Экспорт
	
	МассивСтавок = Новый Массив;
	
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС0);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС10);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС10_110);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС18);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС18_118);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС20);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС20_120);
	
	Если ВерсияПостановленияНДС1137 < 3 Тогда
		МассивСтавок.Добавить(Перечисления.СтавкиНДС.БезНДС);
	КонецЕсли;
	
	Возврат МассивСтавок;
	
КонецФункции

Функция СтавкаНДС(ВидСтавки, Период) Экспорт
	
	Если ВидСтавки = Перечисления.ВидыСтавокНДС.Общая Тогда
		Возврат УчетНДСКлиентСервер.ОбщаяСтавкаНДС(Период);
	ИначеЕсли ВидСтавки = Перечисления.ВидыСтавокНДС.ОбщаяРасчетная Тогда
		Возврат УчетНДСКлиентСервер.ОбщаяРасчетнаяСтавкаНДС(Период);
	ИначеЕсли ВидСтавки = Перечисления.ВидыСтавокНДС.Пониженная Тогда
		Возврат Перечисления.СтавкиНДС.НДС10;
	ИначеЕсли ВидСтавки = Перечисления.ВидыСтавокНДС.ПониженнаяРасчетная Тогда
		Возврат Перечисления.СтавкиНДС.НДС10_110;
	ИначеЕсли ВидСтавки = Перечисления.ВидыСтавокНДС.Нулевая Тогда
		Возврат Перечисления.СтавкиНДС.НДС0;
	ИначеЕсли ВидСтавки = Перечисления.ВидыСтавокНДС.БезНДС Тогда
		Возврат Перечисления.СтавкиНДС.БезНДС;
	Иначе
		Возврат Перечисления.СтавкиНДС.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Для переданной ставки НДС возвращает расчетную ставку.
// Если для переданной ставки нет расчетной, то возвращает переданную в параметре ставку без изменения.
//
// Параметры:
//   СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - обычная ставка НДС для которой нужно получить обычную
//
// Возвращаемое значение:
//   СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - расчетная ставка для переданной
Функция РасчетнаяСтавкаНДСПоОбычной(СтавкаНДС) Экспорт
	
	Если ТипЗнч(СтавкаНДС) <> Тип("ПеречислениеСсылка.СтавкиНДС") Тогда
		Возврат СтавкаНДС;
	КонецЕсли;
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		Возврат Перечисления.СтавкиНДС.НДС18_118;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		Возврат Перечисления.СтавкиНДС.НДС10_110;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		Возврат Перечисления.СтавкиНДС.НДС20_120;
	Иначе
		Возврат СтавкаНДС;
	КонецЕсли;
	
КонецФункции

// Для переданной расчетной ставки НДС возвращает обычную.
// Если для переданной ставки нет соответствия, то возвращает переданную в параметре ставку без изменения.
//
// Параметры:
//   СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - расчетная ставка НДС для которой нужно получить обычную
//
// Возвращаемое значение:
//   СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - обычная ставка для переданной расчетной
Функция ОбычнаяСтавкаНДСПоРасчетной(СтавкаНДС) Экспорт
	
	Если ТипЗнч(СтавкаНДС) <> Тип("ПеречислениеСсылка.СтавкиНДС") Тогда
		Возврат СтавкаНДС;
	КонецЕсли;
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		Возврат Перечисления.СтавкиНДС.НДС18;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		Возврат Перечисления.СтавкиНДС.НДС10;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
		Возврат Перечисления.СтавкиНДС.НДС20;
	Иначе
		Возврат СтавкаНДС;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Параметры.СтрокаПоиска) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ТекущаяДатаПользователя = ОбщегоНазначения.ТекущаяДатаПользователя();
	До2019Года = ТекущаяДатаПользователя < '20190101';
	
	
	Если Параметры.Свойство("ОграниченныйСписок") Тогда
		
		// Ограниченный список для счета-фактуры на аванс.
		
		Если До2019Года Тогда
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС18_118);
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС10_110);
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС20_120);
		Иначе
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС20_120);
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС10_110);
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС18_118);
		КонецЕсли;
		
	ИначеЕсли Параметры.Свойство("РозничнаяПродажа") Тогда
		
		// Ограниченный список для чека и отчета о розничной продаже
		
		Если До2019Года Тогда
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС18);
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС10);
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.БезНДС);
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС20);
		Иначе
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС20);
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС10);
			// С 2022 года гостиничные услуги облагаются по ставке 0%
			Если ТекущаяДатаПользователя >= '20220701' Тогда
				ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС0);
			КонецЕсли;
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.БезНДС);
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС18);
		КонецЕсли;
		
	ИначеЕсли Параметры.Свойство("ОсновныеСтавкиНДС") Тогда
		
		// Ограниченный список для безвозмездной передачи
		
		Если До2019Года Тогда
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС18);
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС10);
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.БезНДС);
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС20);
		Иначе
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС20);
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС10);
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.БезНДС);
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС18);
		КонецЕсли;
	
	ИначеЕсли Параметры.Свойство("СтавкиНДСДоговора") Тогда
	
		Если До2019Года Тогда
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС18);
		Иначе
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС20);
		КонецЕсли;
		ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС10);
		ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС0);
		ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.БезНДС);
		Если До2019Года Тогда
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС20);
		Иначе
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС18);
		КонецЕсли;
	
	Иначе
		
		Если До2019Года Тогда
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС18);
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС18_118);
		Иначе
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС20);
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС20_120);
		КонецЕсли;
		
		ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС10);
		ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС10_110);
		ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС0);
		ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.БезНДС);
		
		Если До2019Года Тогда
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС20);
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС20_120);
		Иначе
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС18);
			ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС18_118);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
